##### [실습] titanic 승객 데이터 활용

**컬럼 설명** 
- PassengerId - 승객 고유번호
- Survived - 생존유무(target 값) (0 = 사망, 1 = 생존)
- Pclass - 티켓 클래스 (1 = 1st, 2 = 2nd, 3 = 3rd)
- Name - 탑승객 성명
- Sex - 성별 (male: 남성, female: 여성)
- Age - 나이(세)
- SibSp - 함께 탑승한 형제자매, 배우자 수 총합
- Parch - 함께 탑승한 부모, 자녀 수 총합
- Ticket - 티켓 넘버
- Fare - 탑승 요금
- Cabin - 객실 넘버
- Embarked - 탑승 항구 (C: Cherbourg, Q: Queenstown, S: Southampton)

In [1]:
import numpy as np
import pandas as pd

In [3]:
# titanic.csv 파일 로드
# titanic 데이터셋의 메타 데이터 확인
df = pd.read_csv('./data/titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

- 기초문제

In [18]:
# 1. 전체 승객 중 생존자의 수와 사망자의 수를 구하여 출력
survived_count = df[df['Survived'] == 1]['PassengerId'].count()
daed_count = df[df['Survived'] == 0]['PassengerId'].count()

print(f'생존자 수: {survived_count}, ', f'사망자 수: {daed_count}')

생존자 수: 342,  사망자 수: 549

In [17]:
# 2. 승객 나이의 평균 출력
print(df['Age'].mean())

29.69911764705882

In [26]:
# 3. 1등급 승객 중 운임이 가장 높은 승객의 이름 출력
fare_max = df[df['Pclass'] == 1]['Fare'].max()
df[(df['Pclass'] == 1) & (df['Fare'] == fare_max)]['Name']

258                      Ward, Miss. Anna
679    Cardeza, Mr. Thomas Drake Martinez
737                Lesurer, Mr. Gustave J
Name: Name, dtype: object

In [36]:
# 4. 여성 승객의 수를 구하여 출력
female_count = df[df['Sex'] == 'female']['PassengerId'].count()
print(female_count)

314

In [39]:
# 5. 운임이 50 이상인 승객의 이름과 운임 출력
df[df['Fare'] >= 50][['Name','Fare']]

                                                  Name      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   53.1000
6                              McCarthy, Mr. Timothy J   51.8625
27                      Fortune, Mr. Charles Alexander  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208
..                                                 ...       ...
856         Wick, Mrs. George Dennick (Mary Hitchcock)  164.8667
863                  Sage, Miss. Dorothy Edith "Dolly"   69.5500
867               Roebling, Mr. Washington Augustus II   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)   83.1583

[161 rows x 2 columns]

In [178]:
# 6. 나이가 18세 미만인 승객들의 생존율을 계산하여 출력
s_under18 = df[(df['Age'] < 18) & (df['Survived'] == 1)]['PassengerId'].count()
d_under18 = df[(df['Age'] < 18) & (df['Survived'] == 0)]['PassengerId'].count()

print(s_under18 / (s_under18 + d_under18))

0.5398230088495575

In [58]:
# 7. 2등급 객실에 탑승한 승객의 평균 운임을 계산하여 출력
print(df[df['Pclass'] == 2]['Fare'].mean())

20.662183152173913

In [66]:
# 8. 승객 중 나이가 가장 많은 사람의 나이와 이름을 출력
max_age = df['Age'].max()
print(df[df['Age'] == max_age][['Age', 'Name']])

      Age                                  Name
630  80.0  Barkworth, Mr. Algernon Henry Wilson

In [68]:
# 9. S 항구에서 탑승한 승객의 수를 출력
print(df[df['Embarked'] == 'S']['PassengerId'].count())

644

In [74]:
# 10. 3등급 객실에 탑승한 남성 승객 중 생존자의 수를 출력
print(df[(df['Pclass'] == 3) & (df['Sex'] == 'male') & (df['Survived'] == 1)]['PassengerId'].count())

47

- 고급문제

In [81]:
# 1. 생존자(Survived)와 그렇지 않은 사람들의 `Pclass`(객실 등급)별 평균 나이를 각각 출력
groupby_passenger = df.groupby(['Survived', 'Pclass'])

print(groupby_passenger['Fare'].mean())

Survived  Pclass
0         1         64.684007
          2         19.412328
          3         13.669364
1         1         95.608029
          2         22.055700
          3         13.694887
Name: Fare, dtype: float64

In [92]:
# 2. `SibSp`(형제/배우자 수)가 3 이상인 승객들 중에서, `Fare`(운임) 상위 5명의 이름과 나이를 출력
df_sibsp = df[df['SibSp'] >= 3].sort_values(by='Fare', ascending=False).head(5)
print(df_sibsp[['Name', 'Age', 'Fare']])

                               Name   Age    Fare
27   Fortune, Mr. Charles Alexander  19.0  263.00
88       Fortune, Miss. Mabel Helen  23.0  263.00
341  Fortune, Miss. Alice Elizabeth  24.0  263.00
159      Sage, Master. Thomas Henry   NaN   69.55
180    Sage, Miss. Constance Gladys   NaN   69.55

In [117]:
# 3. 승객 중에서 `Age` 값이 결측치(NaN)인 사람들의 `Embarked`(탑승 항구)별 분포를 출력
agenull = df['Age'].isna()
groupby_embarked = df[agenull].groupby('Embarked').count()
print(groupby_embarked['PassengerId'])

Embarked
C    38
Q    49
S    90
Name: PassengerId, dtype: int64

In [113]:
# 4. 나이가 16세 미만이고, 혼자 탑승한(`SibSp == 0` and `Parch == 0`) 승객의 이름과 성별, 생존 여부를 출력
df[(df['Age'] < 16) & (df['SibSp'] == 0) & (df['Parch'] == 0)][['Name', 'Sex', 'Survived']]

                                     Name     Sex  Survived
14   Vestrom, Miss. Hulda Amanda Adolfina  female         0
22            McGowan, Miss. Anna "Annie"  female         1
731              Hassan, Mr. Houssein G N    male         0
777         Emanuel, Miss. Virginia Ethel  female         1
780                  Ayoub, Miss. Banoura  female         1
875      Najib, Miss. Adele Kiamie "Jane"  female         1

In [116]:
# 5. 1등급(Pclass == 1) 객실에 탑승한 승객들 중에서, 운임(Fare)이 평균보다 높은 사람들의 이름과 나이, 운임을 출력
fare_avg = df['Fare'].mean()

df[(df['Pclass'] == 1) & (df['Fare'] > fare_avg)][['Name', 'Age', 'Fare']]

                                                  Name   Age      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0   53.1000
6                              McCarthy, Mr. Timothy J  54.0   51.8625
23                        Sloper, Mr. William Thompson  28.0   35.5000
27                      Fortune, Mr. Charles Alexander  19.0  263.0000
..                                                 ...   ...       ...
853                          Lines, Miss. Mary Conover  16.0   39.4000
856         Wick, Mrs. George Dennick (Mary Hitchcock)  45.0  164.8667
867               Roebling, Mr. Washington Augustus II  31.0   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0   83.1583

[159 rows x 3 columns]

In [135]:
# 6. 나이(Age), 객실 등급(Pclass), 운임(Fare) 값에 결측치가 없는 승객들만 대상으로, 각 등급별 평균 운임과 중앙값 운임을 출력
allvalues = df.dropna(subset= ['Age', 'Pclass', 'Fare'],  how='all').reset_index(drop=True)
groupby_class = allvalues.groupby('Pclass')

c_fare_avg = groupby_class['Fare'].mean()
c_fare_med = groupby_class['Fare'].median()

print(f'등급별 평균운임: {c_fare_avg}, 등급별 중앙값: {c_fare_med}')

등급별 평균운임: Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64, 등급별 중앙값: Pclass
1    60.2875
2    14.2500
3     8.0500
Name: Fare, dtype: float64

In [190]:
# 7. 승객들의 `Embarked` 별 평균 나이를 계산하고, 가장 많은 승객이 탑승한 항구를 기준으로 생존율을 계산하여 출력
avg_age_embarked = df.groupby('Embarked')['Age'].mean()
max_embarked = df.groupby('Embarked')['PassengerId'].count()    # S

s_survived = df[(df['Embarked'] == 'S') & (df['Survived'] == 1)]['PassengerId'].count()
s_dead = df[(df['Embarked'] == 'S') & (df['Survived'] == 0)]['PassengerId'].count()

print(s_survived / (s_survived + s_dead))

0.33695652173913043

In [167]:
# 8. 승객 중에서 여성(`Sex == 'female'`)이면서 30세 이상인 사람들의 생존율을 계산하여 출력
s_female_over30 = df[(df['Sex'] == 'female') & (df['Age'] >= 30) & (df['Survived'] == 1)]['PassengerId'].count()
d_female_over30 = df[(df['Sex'] == 'female') & (df['Age'] >= 30) & (df['Survived'] == 0)]['PassengerId'].count()

print(s_female_over30 / (s_female_over30 + d_female_over30))

0.8070175438596491

In [183]:
# 9. 동반한 형제 또는 배우자 수(`SibSp`)와 부모 또는 자녀 수(`Parch`)의 합이 3 이상인 승객들만을 대상으로, 그들의 생존율을 계산하여 출력
s_over3 = df[((df['SibSp'] >= 3) & df['Survived'] == 1) | ((df['Parch'] >= 3) & df['Survived'] == 1)]['PassengerId'].count()
d_over3 = df[((df['SibSp'] >= 3) & df['Survived'] == 0) | ((df['Parch'] >= 3) & df['Survived'] == 0)]['PassengerId'].count()

print(s_over3 / (s_over3 + d_over3))

0.012195121951219513

In [187]:
# 10. `Cabin`(객실 번호) 정보가 있는 승객들만을 대상으로, 그들의 생존율을 객실 등급별로 구분하여 계산하여 출력
cabin_custom = df.dropna(subset = 'Cabin').reset_index(drop=True)
groupby_class = cabin_custom.groupby('Pclass')

survived_cabin = cabin_custom[cabin_custom['Survived'] == 1]['PassengerId'].count()
dead_cabin = cabin_custom[cabin_custom['Survived'] == 0]['PassengerId'].count()

print(survived_cabin / (survived_cabin + dead_cabin))

0.6666666666666666